doc: use mermaid instead of plantuml
